ExampleCases/deformingDroplet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       4286;
    }
    downWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       4316;
    }
    leftandright
    {
        type            patch;
        nFaces          80;
        startFace       4346;
    }
    Front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2160;
        startFace       4426;
    }
    Back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2160;
        startFace       6586;
    }
)

// ************************************************************************* //
