ExampleCases/deformingDroplet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (water air);

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  0.000001;
    rho             rho [1 -3 0 0 0 0 0] 996;
}

air
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  0.000793;
    rho             rho [1 -3 0 0 0 0 0] 970;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.02;


// ************************************************************************* //
