ExampleCases/deformingDroplet/0/Conductive
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "0.12363038048152659443";
    object      Conductive;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
	upWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    downWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftandright
    {
        type            fixedValue;
        value           uniform 0;
    }
    Front
    {
        type            empty;
    }
	Back
    {
        type            empty;
    }
	
}


// ************************************************************************* //
