ExampleCases/deformingDroplet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.water
    {
        nAlphaCorr      1;
        
		isoFaceTol      1e-6;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-10;
        clip            true;
        reconstructionScheme plicRDF;
        writeFields     true;
		writeSurfCells  true;
        writeBoundedCells true;
        writeIsoFaces   false;


        nAlphaSubCycles 1;
        cAlpha          1; // Note: cAlpha is not used by isoAdvector but must
                           // be specified because interfacePropertes object
                           // reads it during construction.
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-09;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-09;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
	
	UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
	
	Ue_EM
    {
		solver		 PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0.1;
    };
	
	Ue_EMFinal
    {
		$Ue_EM;
        tolerance       1e-12;
        relTol          0;
    };

    rhoE_EM
    {
		solver		 PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.001;
    };
	rhoE_EMFinal
    {
		$rhoE_EM;
        tolerance       1e-12;
        relTol          0;
    };
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
	pRefPoint (1.5e-5 1.5e-5 1.5e-5);
	pRefValue 1;
}


// ************************************************************************* //
